#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::u8string> persianMalesFirstNames = {
    u8"آرمان", u8"بهروز",    u8"کیان",    u8"فریدون",  u8"سپهر",  u8"میلاد",   u8"آرشام", u8"پوریا",   u8"بهراد",
    u8"سیاوش", u8"احسان",    u8"شایان",   u8"شهریار",  u8"آرتین", u8"امیدوار", u8"پارسا", u8"کاوه",    u8"پیام",
    u8"آرین",  u8"مانی",     u8"نیما",    u8"فرهاد",   u8"کسری",  u8"کیوان",   u8"رهام",  u8"فرشاد",   u8"آرمین",
    u8"فرزاد", u8"ساماندار", u8"امینوار", u8"امیرعلی", u8"رضوان", u8"حسینیان", u8"ناصر",  u8"محمدرضا", u8"صادق",
    u8"علی",   u8"عباس",     u8"حمید",    u8"جواد",    u8"محمود", u8"علیرضا",  u8"رامبد", u8"پیمان",   u8"مهدی",
    u8"سجاد",  u8"محمد",     u8"یوسف",    u8"محمدعلی", u8"حسین",  u8"رحمان",   u8"رضا",   u8"کاظم",    u8"مهران",
    u8"نادر",  u8"مهدیار",   u8"پرهام",   u8"پیروز",   u8"میثم",  u8"احمد",    u8"مصطفی"};

const std::vector<std::u8string> persianFemalesFirstNames = {
    u8"آتنا",  u8"پریسا",   u8"نازنین", u8"شیرین", u8"الناز", u8"سارا",  u8"زهرا",     u8"ریحانه", u8"بهار",  u8"آیدا",   u8"نیکا",
    u8"مهسا",  u8"نگین",    u8"یاسمن",  u8"آرزو",  u8"لاله",  u8"روژین", u8"ترانه",    u8"پرنیا",  u8"مریم",  u8"پگاه",   u8"سلما",
    u8"ملیسا", u8"نسترن",   u8"مینا",   u8"پرشین", u8"مهتا",  u8"لیلا",  u8"مهرانگیز", u8"زینب",   u8"آزیتا", u8"پرستو",  u8"رها",
    u8"شهناز", u8"سوگند",   u8"فرانکا", u8"لیانا", u8"سمیرا", u8"فاطمه", u8"سهراب",    u8"هلنا",   u8"دلارا", u8"پارمیس", u8"آوا",
    u8"پانیذ", u8"آناهیتا", u8"سحر",    u8"ناهید", u8"آتوسا", u8"بهناز", u8"راحله",    u8"شبنم",   u8"فریبا", u8"نرگس",   u8"رها",
    u8"سهیلا", u8"شیدا",    u8"محیا",   u8"زهره",  u8"زیبا",  u8"رقیه",  u8"مهتاب",    u8"الهه",   u8"ریما",  u8"مهدیس"};
}
